============================================================================================================================================
SEMANTIC SEARCH QA (POST /v1/query/search)
============================================================================================================================================

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #1
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : تنظيم المراسلات
Query          : ضوابط توحيد شكل وطريقة التعامل مع المراسلات الرسمية
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : وضع الضوابط التي تنظم المراسلات الواردة والصادرة وتوثيقها، وتوحد معاييرها الموضوعية والشكلية
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=7ec9f0cc-9b6d-41cc-a6d6-7cf82d63f3b5 | subject=التنسيق المشترك
  3. score=0.015873015873015872 | docId=fc0b915a-8b2d-43b9-a559-620558ee0245 | subject=استمرارية الأعمال
  4. score=0.015625 | docId=eb4e86b4-00b0-424c-9290-0886127062d2 | subject=خطة العمل السنوية
  5. score=0.015384615384615385 | docId=68aa3913-9d24-4f05-a0f4-8817d668aced | subject=معاملة داخلية مهجرة 444444

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #2
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : تنسيق الخطابات
Query          : طريقة كتابة بداية الخطاب الرسمي في أعلى الصفحة
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : تدون البسملة في منتصف أعلى الرسالة (بسم الله الرحمن الرحيم)
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=3e378fc6-a03b-452a-8b1f-1871980032d8 | subject=الموافقة على انشاء احتفال
  3. score=0.015873015873015872 | docId=d6e7b9ab-58e8-4daa-b86a-d092b450bd59 | subject=بشأن تصاريح الدخول للزوار
  4. score=0.015625 | docId=b60ac69b-0d40-4946-8070-ea3233bf7ed9 | subject=بشأن تنفيذ الخصومات 
  5. score=0.015384615384615385 | docId=27fb759d-4295-45b0-8cae-c8ab57edfd35 | subject=incoming - AI - 7

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #3
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : البريد الوارد
Query          : كيفية تقسيم سجلات المعاملات الواردة وترميزها
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : تقسم سجلات الوارد إلى ثلاثة سجلات، تعطى الرموز (٣،٢،١)
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=404e91e5-7fa9-4696-9159-def040301c59 | subject=incoming - AI - 1
  3. score=0.015873015873015872 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  4. score=0.015625 | docId=468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1 | subject=لائحة صلاحيات تطبيق هيئة الرقابة ومكافحة الفساد
  5. score=0.015384615384615385 | docId=679f1f6b-eef9-4a2a-bc7a-c21eb442e7b8 | subject=معاملة واردة

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #4
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : أهمية المراسلات
Query          : تمييز الخطابات التي تحتاج إلى اهتمام خاص عن طريق بطاقة ملونة
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : تميز موضوعات المراسلات المهمة - ذات القيمة - ببطاقة ذات لون ( أخضر ), وبدرجة أهمية واحدة ( مهم )
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4
  3. score=0.015873015873015872 | docId=554dc3e4-e631-4e6c-b8b9-cb0f6fd960cf | subject=test2
  4. score=0.015625 | docId=94923b9b-5be3-44a8-9d03-2565f0ab03fc | subject=test2
  5. score=0.015384615384615385 | docId=a7db294a-d38e-49b0-bb37-8568f73707dd | subject=test-aya

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #5
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : سرية المراسلات
Query          : من يستطيع فتح الخطابات السرية داخل الجهة
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : لا يفتح المراسلات السرية إلا من وجهت إليه الرسالة أو المختص الذي أذن له بفتحها
Actual DocId   : 468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1 | subject=لائحة صلاحيات تطبيق هيئة الرقابة ومكافحة الفساد
  2. score=0.016129032258064516 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  3. score=0.015873015873015872 | docId=eb4e86b4-00b0-424c-9290-0886127062d2 | subject=خطة العمل السنوية
  4. score=0.015625 | docId=2cf91f11-1084-4c23-9f02-89bf39cb28b6 | subject=بشأن طلب تصريح دخول
  5. score=0.015384615384615385 | docId=3f8e3353-125f-4d21-bd49-d570ccf9eaf4 | subject=بشأن تعميد قرار لجنة 

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #6
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : صلاحية التوقيع
Query          : من يملك صلاحية اعتماد وإصدار الخطاب الرسمي
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : أن تصدر بتوقيع صاحب الصلاحية أو من يفوضه
Actual DocId   : 468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1 | subject=لائحة صلاحيات تطبيق هيئة الرقابة ومكافحة الفساد
  2. score=0.016129032258064516 | docId=2cf91f11-1084-4c23-9f02-89bf39cb28b6 | subject=بشأن طلب تصريح دخول
  3. score=0.015873015873015872 | docId=3f8e3353-125f-4d21-bd49-d570ccf9eaf4 | subject=بشأن تعميد قرار لجنة 
  4. score=0.015625 | docId=8230e715-8715-4938-b107-8e7f7aecd086 | subject=بشأن انتداب موظفين لوزارة الطاقة
  5. score=0.015384615384615385 | docId=a6881cf2-bc8f-4367-83b3-d8fa961600b3 | subject=خطاب إلحاقي

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #7
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : متابعة المعاملات
Query          : متابعة حركة المعاملات الواردة ومعرفة أين وصلت
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : تمكين المختصين بالمتابعة من الدخول على نظام الاتصالات الإدارية لمعرفة حركة المراسلات وفق صلاحيات محددة
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=fc0b915a-8b2d-43b9-a559-620558ee0245 | subject=استمرارية الأعمال
  3. score=0.015873015873015872 | docId=468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1 | subject=لائحة صلاحيات تطبيق هيئة الرقابة ومكافحة الفساد
  4. score=0.015625 | docId=7ec9f0cc-9b6d-41cc-a6d6-7cf82d63f3b5 | subject=التنسيق المشترك
  5. score=0.015384615384615385 | docId=4941377c-e193-4570-8788-8704eb6adc92 | subject=اضافه ختم 2

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #8
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : حماية الوثائق
Query          : كيفية نقل الملفات والوثائق بطريقة تمنع تلفها أو كشف محتواها
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : أن تجري عملية النقل بطريقة آمنة يراعي فيها حفظ سرية المحتوى
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=b63034dd-c790-4504-a862-45e480cbcb2b | subject=وثيقة للتوجيه
  3. score=0.015873015873015872 | docId=7a1f8312-3b24-4644-a68b-1c544885d1ac | subject=تنزيل معاملة
  4. score=0.015625 | docId=6dae1b7d-b8d9-4a80-a5a9-ab705f130b58 | subject=تنزيل معاملة داخلية
  5. score=0.015384615384615385 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #9
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : الوثائق الدائمة
Query          : هل يمكن تداول النسخ الأصلية من الوثائق التي يجب الاحتفاظ بها بشكل دائم
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : لا يتم تداول أصول الوثائق الدائمة الحفظ، ويكتفى بتداول نسخ أو صور منها
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=fc0b915a-8b2d-43b9-a559-620558ee0245 | subject=استمرارية الأعمال
  3. score=0.015873015873015872 | docId=6dae1b7d-b8d9-4a80-a5a9-ab705f130b58 | subject=تنزيل معاملة داخلية
  4. score=0.015625 | docId=467d69e1-26db-4ed4-bd1d-36aa7cf24638 | subject=معاملة صادرة - 5
  5. score=0.015384615384615385 | docId=3028cca8-fa3a-409c-8625-8f2ea93ad3ff | subject=تنزيل معاملة

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #10
Document       : لائحة الاتصالات الرسمية والمحافظة على الوثائق ومعلوماتها
Category       : نفاذ اللائحة
Query          : متى يبدأ تطبيق اللائحة بعد نشرها رسميا
Expected UUID  : 862116af-472d-453f-9235-e8dc52ae0224
Expected Match : تنشر هذه اللائحة في الجريدة الرسمية، وتصبح نافذة بعد ( مائة وثمانين ) يوما من تاريخ نشرها
Actual DocId   : 121827d4-c58f-4c7e-92d1-430b26890aef
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  2. score=0.016129032258064516 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  3. score=0.015873015873015872 | docId=2cf91f11-1084-4c23-9f02-89bf39cb28b6 | subject=بشأن طلب تصريح دخول
  4. score=0.015625 | docId=3f8e3353-125f-4d21-bd49-d570ccf9eaf4 | subject=بشأن تعميد قرار لجنة 
  5. score=0.015384615384615385 | docId=8230e715-8715-4938-b107-8e7f7aecd086 | subject=بشأن انتداب موظفين لوزارة الطاقة

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #11
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : هدف السياسة
Query          : الغرض من تنظيم نشر البيانات العامة في الجامعة
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : تهدف هذه السياسة إلى تحديد متطلبات نشر البيانات المفتوحة لجامعة الملك سعود - المصنفة بأنها بيانات عامة طبقا لسياسة تصنيف البيانات
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=467d69e1-26db-4ed4-bd1d-36aa7cf24638 | subject=معاملة صادرة - 5
  3. score=0.015873015873015872 | docId=677226e2-1ab5-45f4-b2bf-3b9d13a91208 | subject=واردة للحذف
  4. score=0.015625 | docId=68aa3913-9d24-4f05-a0f4-8817d668aced | subject=معاملة داخلية مهجرة 444444
  5. score=0.015384615384615385 | docId=8ebe7d47-2c98-4793-9d9d-4de4adc05693 | subject=التقرير السنوي لعام 2026 الاولي

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #12
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : نطاق التطبيق
Query          : ما نوع البيانات التي تشملها سياسة البيانات المفتوحة في الجامعة
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : تطبق هذه السياسة على مجموعة محددة من البيانات والمعلومات العامة التي تنتجها أو تجمعها جامعة الملك سعود
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=467d69e1-26db-4ed4-bd1d-36aa7cf24638 | subject=معاملة صادرة - 5
  3. score=0.015873015873015872 | docId=eb4e86b4-00b0-424c-9290-0886127062d2 | subject=خطة العمل السنوية
  4. score=0.015625 | docId=677226e2-1ab5-45f4-b2bf-3b9d13a91208 | subject=واردة للحذف
  5. score=0.015384615384615385 | docId=fc0b915a-8b2d-43b9-a559-620558ee0245 | subject=استمرارية الأعمال

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #13
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : البيانات العامة
Query          : البيانات التي يمكن نشرها باعتبارها معلومات عامة في الجامعة
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : المصنفة بأنها بيانات عامة طبقا لسياسة تصنيف البيانات
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=467d69e1-26db-4ed4-bd1d-36aa7cf24638 | subject=معاملة صادرة - 5
  3. score=0.015873015873015872 | docId=677226e2-1ab5-45f4-b2bf-3b9d13a91208 | subject=واردة للحذف
  4. score=0.015625 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4
  5. score=0.015384615384615385 | docId=554dc3e4-e631-4e6c-b8b9-cb0f6fd960cf | subject=test2

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #14
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : التشريعات
Query          : الأنظمة والضوابط الوطنية التي تعتمد عليها سياسة نشر البيانات
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : الالتزام بالمتطلبات التشريعية الخاصة بها في وثيقتي «ضوابط إدارة البيانات وحوكمتها وحماية البيانات الشخصية
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  3. score=0.015873015873015872 | docId=fc0b915a-8b2d-43b9-a559-620558ee0245 | subject=استمرارية الأعمال
  4. score=0.015625 | docId=eb4e86b4-00b0-424c-9290-0886127062d2 | subject=خطة العمل السنوية
  5. score=0.015384615384615385 | docId=7ec9f0cc-9b6d-41cc-a6d6-7cf82d63f3b5 | subject=التنسيق المشترك

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #15
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : التقارير
Query          : التقرير السنوي الخاص بإنجازات خطة البيانات المفتوحة
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : إعداد تقرير سنوي يقدم إلى مكتب إدارة البيانات الوطنية
Actual DocId   : eb4e86b4-00b0-424c-9290-0886127062d2
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=eb4e86b4-00b0-424c-9290-0886127062d2 | subject=خطة العمل السنوية
  2. score=0.016129032258064516 | docId=8ebe7d47-2c98-4793-9d9d-4de4adc05693 | subject=التقرير السنوي لعام 2026 الاولي
  3. score=0.015873015873015872 | docId=9427c74e-92e8-4dff-a75f-da7fe0b27db4 | subject=التقرير السنوي
  4. score=0.015625 | docId=404e91e5-7fa9-4696-9159-def040301c59 | subject=incoming - AI - 1
  5. score=0.015384615384615385 | docId=bc4e7bb3-7a66-4b77-9052-ac0c2577b298 | subject=تيست - KCTS-209

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #16
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : مؤشرات الأداء
Query          : قياس تقدم الجامعة في تنفيذ خطة البيانات المفتوحة وعدد البيانات المنشورة
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : الأهداف ومؤشرات الأداء الرئيسية المحددة في خطة البيانات المفتوحة
Actual DocId   : d8463c88-4036-400b-a6c0-7b9e63eb5568
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=d8463c88-4036-400b-a6c0-7b9e63eb5568 | subject=تيست - اشعار رفض
  2. score=0.016129032258064516 | docId=467d69e1-26db-4ed4-bd1d-36aa7cf24638 | subject=معاملة صادرة - 5
  3. score=0.015873015873015872 | docId=8ebe7d47-2c98-4793-9d9d-4de4adc05693 | subject=التقرير السنوي لعام 2026 الاولي
  4. score=0.015625 | docId=d2773607-3d2d-4d6e-95b4-635a49a2b703 | subject=معاملة صادرة - 5
  5. score=0.015384615384615385 | docId=8feda61c-94e7-4b12-a529-7d61bf256d7b | subject=معاملة صادرة - 2

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #17
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : مجموعات البيانات
Query          : عدد مجموعات البيانات التي تم تجهيزها للنشر مقارنة بالمنشورة فعليا
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : عدد مجموعات البيانات المفتوحة المحددة للنشر. - عدد مجموعات البيانات المفتوحة المنشورة
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4
  3. score=0.015873015873015872 | docId=554dc3e4-e631-4e6c-b8b9-cb0f6fd960cf | subject=test2
  4. score=0.015625 | docId=94923b9b-5be3-44a8-9d03-2565f0ab03fc | subject=test2
  5. score=0.015384615384615385 | docId=a7db294a-d38e-49b0-bb37-8568f73707dd | subject=test-aya

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #18
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : التدقيق
Query          : الاستعداد لمراجعة الالتزام بسياسة البيانات المفتوحة
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : رفع جاهزية الجامعة لأي عملية تدقيق داخلي أو خارجي لتقييم امتثالها لسياسة البيانات المفتوحة
Actual DocId   : 4803313b-4611-469e-b587-5a199500079f
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4
  2. score=0.016129032258064516 | docId=554dc3e4-e631-4e6c-b8b9-cb0f6fd960cf | subject=test2
  3. score=0.015873015873015872 | docId=94923b9b-5be3-44a8-9d03-2565f0ab03fc | subject=test2
  4. score=0.015625 | docId=a7db294a-d38e-49b0-bb37-8568f73707dd | subject=test-aya
  5. score=0.015384615384615385 | docId=2dc465c4-2bbe-4683-bea7-a6c99c6197fb | subject=cancel-out7

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #19
Document       : سياسة البيانات المفتوحة - جامعة الملك سعود
Category       : عدم الامتثال
Query          : الإجراءات المتبعة عندما تظهر مخالفات أو نقاط عدم التزام بالسياسة
Expected UUID  : cb850770-7f27-4a47-b6cd-e456e9795734
Expected Match : عند وجود نقاط عدم امتثال، يقوم مكتب إدارة البيانات
Actual DocId   : 121827d4-c58f-4c7e-92d1-430b26890aef
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  2. score=0.016129032258064516 | docId=a7b90b45-1ff1-4ab3-b430-9930858c7cb7 | subject=معاملة تعيين مستشار بحثي 
  3. score=0.015873015873015872 | docId=e8a26eef-4d26-4218-a178-f5d5b7a8ad02 | subject=outgoing - AI - 6
  4. score=0.015625 | docId=468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1 | subject=لائحة صلاحيات تطبيق هيئة الرقابة ومكافحة الفساد
  5. score=0.015384615384615385 | docId=311070aa-ba6c-4b59-afc1-fa634270593b | subject=معاملة اختبار التعميم

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #20
Document       : قرار إعادة تشكيل مجلس الوزراء
Category       : تشكيل مجلس الوزراء
Query          : القرار الملكي المتعلق بالتشكيل الجديد لمجلس الوزراء
Expected UUID  : d5245e7f-457b-4a15-844c-b36b8c2c7575
Expected Match : وبعد الاطلاع على الأمرين الملكيين رقم (أ/٦١) ورقم (أ/٦٢) المؤرخين في ١٤٤٤/٣/١ه، الصادرين بشأن تشكيل مجلس الوزراء
Actual DocId   : b418382d-b655-4945-ade0-82c441024e5f
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=b418382d-b655-4945-ade0-82c441024e5f | subject=outgoing - AI - 6
  2. score=0.016129032258064516 | docId=86c1bc70-e462-427b-a8b3-85c407bf8ee9 | subject=بشأن قرار لجنة
  3. score=0.015873015873015872 | docId=7adbee21-0f14-4bba-b6cb-562610f5c51d | subject=بشأن تعميد قرار اداري
  4. score=0.015625 | docId=27fb759d-4295-45b0-8cae-c8ab57edfd35 | subject=incoming - AI - 7
  5. score=0.015384615384615385 | docId=2cf91f11-1084-4c23-9f02-89bf39cb28b6 | subject=بشأن طلب تصريح دخول

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #21
Document       : قرار إعادة تشكيل مجلس الوزراء
Category       : المرجع النظامي
Query          : الأنظمة التي تم الرجوع إليها قبل إصدار قرار إعادة تشكيل الحكومة
Expected UUID  : d5245e7f-457b-4a15-844c-b36b8c2c7575
Expected Match : بعد الاطلاع على النظام الأساسي للحكم، الصادر بالأمر الملكي رقم (أ/٩٠) بتاريخ ١٤١٢/٨/٢٧ه
Actual DocId   : b418382d-b655-4945-ade0-82c441024e5f
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=b418382d-b655-4945-ade0-82c441024e5f | subject=outgoing - AI - 6
  2. score=0.016129032258064516 | docId=27fb759d-4295-45b0-8cae-c8ab57edfd35 | subject=incoming - AI - 7
  3. score=0.015873015873015872 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  4. score=0.015625 | docId=a6881cf2-bc8f-4367-83b3-d8fa961600b3 | subject=خطاب إلحاقي
  5. score=0.015384615384615385 | docId=8230e715-8715-4938-b107-8e7f7aecd086 | subject=بشأن انتداب موظفين لوزارة الطاقة

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #22
Document       : قرار إعادة تشكيل مجلس الوزراء
Category       : مجلس الوزراء
Query          : المستند النظامي الذي ينظم عمل مجلس الوزراء
Expected UUID  : d5245e7f-457b-4a15-844c-b36b8c2c7575
Expected Match : وبعد الاطلاع على المادة (٩) من نظام مجلس الوزراء
Actual DocId   : bc4e7bb3-7a66-4b77-9052-ac0c2577b298
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=bc4e7bb3-7a66-4b77-9052-ac0c2577b298 | subject=تيست - KCTS-209
  2. score=0.016129032258064516 | docId=a7b90b45-1ff1-4ab3-b430-9930858c7cb7 | subject=معاملة تعيين مستشار بحثي 
  3. score=0.015873015873015872 | docId=8a77260c-7d59-4478-b88b-f4813b0ae76e | subject=بشأن العمل عن بعد والعمل المرن
  4. score=0.015625 | docId=b418382d-b655-4945-ade0-82c441024e5f | subject=outgoing - AI - 6
  5. score=0.015384615384615385 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #23
Document       : قرار إعادة تشكيل مجلس الوزراء
Category       : الأوامر الملكية
Query          : الأوامر السابقة المرتبطة بتشكيل مجلس الوزراء
Expected UUID  : d5245e7f-457b-4a15-844c-b36b8c2c7575
Expected Match : الأمرين الملكيين رقم (أ/٦١) ورقم (أ/٦٢)
Actual DocId   : b418382d-b655-4945-ade0-82c441024e5f
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=b418382d-b655-4945-ade0-82c441024e5f | subject=outgoing - AI - 6
  2. score=0.016129032258064516 | docId=27fb759d-4295-45b0-8cae-c8ab57edfd35 | subject=incoming - AI - 7
  3. score=0.015873015873015872 | docId=2cf91f11-1084-4c23-9f02-89bf39cb28b6 | subject=بشأن طلب تصريح دخول
  4. score=0.015625 | docId=3f8e3353-125f-4d21-bd49-d570ccf9eaf4 | subject=بشأن تعميد قرار لجنة 
  5. score=0.015384615384615385 | docId=8230e715-8715-4938-b107-8e7f7aecd086 | subject=بشأن انتداب موظفين لوزارة الطاقة

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #24
Document       : قرار إعادة تشكيل مجلس الوزراء
Category       : القرار
Query          : الوثيقة الرسمية التي تتناول إعادة تنظيم أعضاء مجلس الوزراء
Expected UUID  : d5245e7f-457b-4a15-844c-b36b8c2c7575
Expected Match : في شأن تشكيل مجلس الوزراء
Actual DocId   : b418382d-b655-4945-ade0-82c441024e5f
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=b418382d-b655-4945-ade0-82c441024e5f | subject=outgoing - AI - 6
  2. score=0.016129032258064516 | docId=27fb759d-4295-45b0-8cae-c8ab57edfd35 | subject=incoming - AI - 7
  3. score=0.015873015873015872 | docId=86c1bc70-e462-427b-a8b3-85c407bf8ee9 | subject=بشأن قرار لجنة
  4. score=0.015625 | docId=7adbee21-0f14-4bba-b6cb-562610f5c51d | subject=بشأن تعميد قرار اداري
  5. score=0.015384615384615385 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #25
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : التعريفات
Query          : المقصود بحوكمة التعاون بين وزارة الصناعة والجهات الحكومية
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : الحوكمة: حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة في شأن الإجراءات المتعلقة بالمنشآت الصناعية
Actual DocId   : d744c56b-afb2-4874-8cbb-c0e955422cd8
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=d744c56b-afb2-4874-8cbb-c0e955422cd8 | subject=outgoing AI - 2
  2. score=0.016129032258064516 | docId=f95c1f6e-282e-41bc-9edc-3949aa643f72 | subject=outgoing AI- 1
  3. score=0.015873015873015872 | docId=c5111f72-7a3c-4fa0-9749-123f1a608f4b | subject=بشأن إعداد ندوة تعريفية 
  4. score=0.015625 | docId=8feda61c-94e7-4b12-a529-7d61bf256d7b | subject=معاملة صادرة - 2
  5. score=0.015384615384615385 | docId=2cf91f11-1084-4c23-9f02-89bf39cb28b6 | subject=بشأن طلب تصريح دخول

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #26
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : المنشآت الصناعية
Query          : التنسيق الحكومي بشأن الإجراءات التي تؤثر على المصانع
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : في شأن الإجراءات المتعلقة بالمنشآت الصناعية
Actual DocId   : d744c56b-afb2-4874-8cbb-c0e955422cd8
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=d744c56b-afb2-4874-8cbb-c0e955422cd8 | subject=outgoing AI - 2
  2. score=0.016129032258064516 | docId=f95c1f6e-282e-41bc-9edc-3949aa643f72 | subject=outgoing AI- 1
  3. score=0.015873015873015872 | docId=8feda61c-94e7-4b12-a529-7d61bf256d7b | subject=معاملة صادرة - 2
  4. score=0.015625 | docId=d8463c88-4036-400b-a6c0-7b9e63eb5568 | subject=تيست - اشعار رفض
  5. score=0.015384615384615385 | docId=dcfa18cc-1349-480c-83bf-dca0e1349c18 | subject=بشأن قرار اعتماد ساعات العمل المرنه

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #27
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : إيقاف الإنتاج
Query          : إجراءات الجهات الحكومية عندما يتم إيقاف خط إنتاج مصنع بسبب مخالفة
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : في حال أوقف خط الإنتاج بسبب ارتكاب مخالفة تستدعي ذلك نظاما؛ تزود الجهة المختصة الوزارة بتقرير تفصيلي عن أسباب الإيقاف
Actual DocId   : e8a26eef-4d26-4218-a178-f5d5b7a8ad02
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=e8a26eef-4d26-4218-a178-f5d5b7a8ad02 | subject=outgoing - AI - 6
  2. score=0.016129032258064516 | docId=d744c56b-afb2-4874-8cbb-c0e955422cd8 | subject=outgoing AI - 2
  3. score=0.015873015873015872 | docId=f95c1f6e-282e-41bc-9edc-3949aa643f72 | subject=outgoing AI- 1
  4. score=0.015625 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  5. score=0.015384615384615385 | docId=8230e715-8715-4938-b107-8e7f7aecd086 | subject=بشأن انتداب موظفين لوزارة الطاقة

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #28
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : التقارير
Query          : المدة المحددة لإبلاغ وزارة الصناعة بأسباب إيقاف خط إنتاج
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : في مدة لا تزيد على (٥) أيام عمل من تاريخ إيقاف خط الإنتاج
Actual DocId   : 36f24fbf-394e-4055-9cfe-5cc3d2907859
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=36f24fbf-394e-4055-9cfe-5cc3d2907859 | subject=outgoing - AI - 5
  2. score=0.016129032258064516 | docId=d744c56b-afb2-4874-8cbb-c0e955422cd8 | subject=outgoing AI - 2
  3. score=0.015873015873015872 | docId=f95c1f6e-282e-41bc-9edc-3949aa643f72 | subject=outgoing AI- 1
  4. score=0.015625 | docId=1564c68a-8575-463e-a11e-67a8bb683d6e | subject=outgoing - AI - 4
  5. score=0.015384615384615385 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #29
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : تصحيح المخالفات
Query          : التنسيق مع المصنع لمعالجة المخالفة بعد إيقاف الإنتاج
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : تنسيق الوزارة مع المنشأة الصناعية لتصحيح المخالفة، وفق الإجراءات النظامية ذات الصلة
Actual DocId   : e8a26eef-4d26-4218-a178-f5d5b7a8ad02
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=e8a26eef-4d26-4218-a178-f5d5b7a8ad02 | subject=outgoing - AI - 6
  2. score=0.016129032258064516 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  3. score=0.015873015873015872 | docId=d744c56b-afb2-4874-8cbb-c0e955422cd8 | subject=outgoing AI - 2
  4. score=0.015625 | docId=f95c1f6e-282e-41bc-9edc-3949aa643f72 | subject=outgoing AI- 1
  5. score=0.015384615384615385 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #30
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : قياس الأثر
Query          : دراسة تأثير إغلاق خطوط الإنتاج على القطاع الصناعي ورؤية 2030
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : تقيس أثر ذلك على تطور الصناعة، ومستهدفات رؤية المملكة العربية السعودية ٢٠٣٠
Actual DocId   : f0b3c289-2d4b-49e5-8083-1f6459553c9e
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=f0b3c289-2d4b-49e5-8083-1f6459553c9e | subject=test code3
  2. score=0.016129032258064516 | docId=5454d0fa-3d52-4f88-ba1a-592d07930554 | subject=بشأن دعوة حضور دورة تدريبية 
  3. score=0.015873015873015872 | docId=dcfa18cc-1349-480c-83bf-dca0e1349c18 | subject=بشأن قرار اعتماد ساعات العمل المرنه
  4. score=0.015625 | docId=d744c56b-afb2-4874-8cbb-c0e955422cd8 | subject=outgoing AI - 2
  5. score=0.015384615384615385 | docId=f95c1f6e-282e-41bc-9edc-3949aa643f72 | subject=outgoing AI- 1

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #31
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : اللجان التنسيقية
Query          : اجتماعات اللجان المشتركة بين الوزارة والجهات المختصة
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : تعقد اللجان التنسيقية اجتماعاتها -حضوريا أو مرئيا- متى دعت الحاجة إلى ذلك
Actual DocId   : 404e91e5-7fa9-4696-9159-def040301c59
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=404e91e5-7fa9-4696-9159-def040301c59 | subject=incoming - AI - 1
  2. score=0.016129032258064516 | docId=7ec9f0cc-9b6d-41cc-a6d6-7cf82d63f3b5 | subject=التنسيق المشترك
  3. score=0.015873015873015872 | docId=86c1bc70-e462-427b-a8b3-85c407bf8ee9 | subject=بشأن قرار لجنة
  4. score=0.015625 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  5. score=0.015384615384615385 | docId=7adbee21-0f14-4bba-b6cb-562610f5c51d | subject=بشأن تعميد قرار اداري

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #32
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : توصيات اللجان
Query          : كيفية اعتماد قرارات وتوصيات اللجنة المشتركة
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : تصدر اللجان التنسيقية توصياتها بالاتفاق بين الوزارة والجهة المختصة ذات العلاقة
Actual DocId   : 404e91e5-7fa9-4696-9159-def040301c59
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=404e91e5-7fa9-4696-9159-def040301c59 | subject=incoming - AI - 1
  2. score=0.016129032258064516 | docId=bc4e7bb3-7a66-4b77-9052-ac0c2577b298 | subject=تيست - KCTS-209
  3. score=0.015873015873015872 | docId=468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1 | subject=لائحة صلاحيات تطبيق هيئة الرقابة ومكافحة الفساد
  4. score=0.015625 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  5. score=0.015384615384615385 | docId=7adbee21-0f14-4bba-b6cb-562610f5c51d | subject=بشأن تعميد قرار اداري

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #33
Document       : حوكمة التنسيق بين وزارة الصناعة والثروة المعدنية والجهات المختصة
Category       : رفع النتائج
Query          : إلى من ترفع اللجنة نتائج اجتماعاتها والمعوقات التي تواجهها
Expected UUID  : d6b2df42-9290-49ad-9be0-19ea6b7b0f72
Expected Match : ترفع كل لجنة تنسيقية نتائج أعمالها وتوصياتها واحتياجاتها وما قد يواجهها من معوقات إلى وزير الصناعة والثروة المعدنية، ووزير الجهة المختصة أو رئيسها
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : FAIL
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=468bd5fe-93c2-47cd-b8e0-89ab5cbf35e1 | subject=لائحة صلاحيات تطبيق هيئة الرقابة ومكافحة الفساد
  3. score=0.015873015873015872 | docId=bc4e7bb3-7a66-4b77-9052-ac0c2577b298 | subject=تيست - KCTS-209
  4. score=0.015625 | docId=404e91e5-7fa9-4696-9159-def040301c59 | subject=incoming - AI - 1
  5. score=0.015384615384615385 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #34
Document       : NEGATIVE
Category       : Garbage
Query          : طريقة تحضير القهوة العربية في المنزل
Expected UUID  : None
Expected Match : لا يجب إرجاع أي من الوثائق الأربعة
Actual DocId   : d744c56b-afb2-4874-8cbb-c0e955422cd8
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : PASS
Top Results:
  1. score=0.01639344262295082 | docId=d744c56b-afb2-4874-8cbb-c0e955422cd8 | subject=outgoing AI - 2
  2. score=0.016129032258064516 | docId=f95c1f6e-282e-41bc-9edc-3949aa643f72 | subject=outgoing AI- 1
  3. score=0.015873015873015872 | docId=6dae1b7d-b8d9-4a80-a5a9-ab705f130b58 | subject=تنزيل معاملة داخلية
  4. score=0.015625 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  5. score=0.015384615384615385 | docId=27fb759d-4295-45b0-8cae-c8ab57edfd35 | subject=incoming - AI - 7

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #35
Document       : NEGATIVE
Category       : Garbage
Query          : أفضل أماكن السياحة في أوروبا خلال فصل الصيف
Expected UUID  : None
Expected Match : لا يجب إرجاع أي من الوثائق الأربعة
Actual DocId   : 4803313b-4611-469e-b587-5a199500079f
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : PASS
Top Results:
  1. score=0.01639344262295082 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4
  2. score=0.016129032258064516 | docId=554dc3e4-e631-4e6c-b8b9-cb0f6fd960cf | subject=test2
  3. score=0.015873015873015872 | docId=94923b9b-5be3-44a8-9d03-2565f0ab03fc | subject=test2
  4. score=0.015625 | docId=a7db294a-d38e-49b0-bb37-8568f73707dd | subject=test-aya
  5. score=0.015384615384615385 | docId=2dc465c4-2bbe-4683-bea7-a6c99c6197fb | subject=cancel-out7

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #36
Document       : NEGATIVE
Category       : Garbage
Query          : كيفية إصلاح محرك السيارة إذا ارتفعت حرارته
Expected UUID  : None
Expected Match : لا يجب إرجاع أي من الوثائق الأربعة
Actual DocId   : 220df768-4954-4017-8a75-3bf33d1572c0
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : PASS
Top Results:
  1. score=0.01639344262295082 | docId=220df768-4954-4017-8a75-3bf33d1572c0 | subject=لائحة الاتصالات الرسمية
  2. score=0.016129032258064516 | docId=121827d4-c58f-4c7e-92d1-430b26890aef | subject=نظام إيرادات الدولة لعام 1448هـ
  3. score=0.015873015873015872 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4
  4. score=0.015625 | docId=554dc3e4-e631-4e6c-b8b9-cb0f6fd960cf | subject=test2
  5. score=0.015384615384615385 | docId=94923b9b-5be3-44a8-9d03-2565f0ab03fc | subject=test2

--------------------------------------------------------------------------------------------------------------------------------------------
Test Case #37
Document       : NEGATIVE
Category       : Garbage
Query          : تمارين رياضية لبناء العضلات في المنزل
Expected UUID  : None
Expected Match : لا يجب إرجاع أي من الوثائق الأربعة
Actual DocId   : 4803313b-4611-469e-b587-5a199500079f
Actual Score   : 0.01639344262295082
Returned Count : 8
Total (server) : 83
Status         : PASS
Top Results:
  1. score=0.01639344262295082 | docId=4803313b-4611-469e-b587-5a199500079f | subject=test4
  2. score=0.016129032258064516 | docId=554dc3e4-e631-4e6c-b8b9-cb0f6fd960cf | subject=test2
  3. score=0.015873015873015872 | docId=94923b9b-5be3-44a8-9d03-2565f0ab03fc | subject=test2
  4. score=0.015625 | docId=a7db294a-d38e-49b0-bb37-8568f73707dd | subject=test-aya
  5. score=0.015384615384615385 | docId=2dc465c4-2bbe-4683-bea7-a6c99c6197fb | subject=cancel-out7

============================================================================================================================================
SUMMARY
============================================================================================================================================
Total Tests : 37
Passed      : 4
Failed      : 33
Pass Rate   : 10.81%
